feat: add parameters for reddit engine to tweak the fetch result size - Improve README
